# Brewfile

# Core CLI tools
brew "stow"
brew "neovim"
brew "ripgrep"
brew "bat"
brew "eza"
brew "git-delta"
brew "fzf"
brew "starship"
brew "fd"
brew "jq"
brew "tree"
brew "htop"
brew "mise"

# Fonts
cask "font-fira-code-nerd-font"

# Apps
cask "iterm2"
cask "visual-studio-code"
cask "codex"
cask "cursor"
cask "claude-code"
cask "claude"
